// 01_backtic.js
// TODO: 백틱(backtic) : 
// 예제 : 문자열 붙이기
// 출력 : 10
//       20
// let num = 10;
// let num2 = 20;
// alert(num + "\n" + num2);

// TODO: 백틱 이용
// TODO: 사용법 : `${변수명} 문자열 ${변수명2} ...`
// let num = 10;
// let num2 = 20;
// console.log(`${num}
// ${num2}`)

// 연습문제 1) 변수 2개를 사용해서 백틱으로 화면에 출력하세요
// 입력 : x
// 출력 : 안녕하세요 우리 교육센터에 방문하신 것을 환영합니다.
// let val = "안녕하세요";
// let val2 = "교육센터";
// // 출력
// console.log(`${val} 우리 ${val2}에 방문하신 것을 환영합니다.`)

// 연습문제 2) 변수 3개를 사용해서 백틱으로 화면에 출력하세요
// 출력 : 
// 4월은 잔인한 달 - 엘리엇
// 4월은 가장 잔인한 달
// 죽은 땅에서 라일락을 키워내고
// 기억과 욕망을 뒤섞고
// 봄비로 잠든 뿌리를 뒤흔든다
let val = "4월";
let val2 = "잔인한 달";
let val3 = "라일락";
// 출력
console.log(`${val}은 ${val2} - 엘리엇
4월은 가장 ${val2}
죽은 땅에서 ${val3}을 키워내고
기억과 욕망을 뒤섞고
봄비로 잠든 뿌리를 뒤흔든다
`)