// 04_Code_100_1.js
// CodeUp 100제 문제 풀이
// 📃 1001) 퀴즈
// 문제 :
// // 1001
// // 출력 : Hello
// alert("Hello");

// 📃 1002) 퀴즈
// 문제 :
// 1002
// 출력 : Hello World
// alert("Hello World");

// 📃 1003) 퀴즈
// 문제 :
// 1003
// 출력 : Hello 
//       World
// 줄바꿈 : \n 
// alert("Hello\nWorld");

// 📃 1004) 퀴즈
// 문제 :
// 1004
// 출력 : 'Hello'
// alert("'Hello'");

// 📃 1005) 퀴즈
// 문제 :
// 1005
// 출력 : "Hello World" 
// alert('"Hello World"');

// 📃 1006) 퀴즈
// 문제 :
// 1006
// 출력 : "!@#$%^&*()"
// alert('"!@#$%^&*()"');

// 📃 1007) 퀴즈
// 문제 :
// 1007
// 출력 : "C:\Download\hello.js"
// TODO : 힌트 : \(역슬래쉬) => \\
alert('"C:\\Download\\hello.js"');