// 15_for_2.js
// 복습 예제 3) 1 ~ 20까지 출력하세요
// 단, console.log 사용하세요
// for(let i=1; i<21; i++) {
//     // i=1 ~ 20까지 변함
//     console.log(i); 
// }

// 연습 1) 1 ~ 20까지 중 짝수만 출력하세요
// 단, console.log 사용하세요
// TODO: 힌트 : %(나머지 연산자)
// for(let i=1; i<21; i++) {
//     // i=1 ~ 20까지 변함
//     // TODO: 조건문 : 짝수일때 console.log(i) 출력하기 코딩
//     if(i % 2 === 0) {
//         // 짝수일때
//         console.log(i); 
//     }
// }

// TODO: 누적합 (숫자, 문자) *
// TODO: 숫자 누적합 : 모든 숫자 더하기 등 
// TODO: 예제 3) 1 ~ 10까지 모든 숫자를 더해서 최종 결과를 출력하세요
// TODO: 1+2+3...+10 = 55
// 출력 : 55
// let sumVal = 0; // 누적된 최종 결과를 저장할 변수

// // 반복문
// for(let i=1; i<11;i++) {
//     // i=1 ~ 10 까지 증가하는 값
//     // 1) i=1 -> 1<11(참) -> 0 = 0 + 1 => sumVal=1, i=2(1증가)
//     // 2) i=2 -> 2<11(참) -> 3 = 1 + 2 => sumVal=3; i=3(1증가)
//     // 3) i=3 -> 3<11(참) -> 6 = 3 + 3 => sumVal=6; i=4(1증가)
//     //  ...
//     // 10) i=10 -> 10<11(참) -> sumVal=55; i=11(1증가)
//     sumVal = sumVal + i; // 누적합 코드
// }
// alert(sumVal);

// TODO: 문자열을 계속 붙이기
// TODO: 예제 4) ********** (10개) 를 화면에 표시하세요
// 단, 반복문을 이용하세요
let char = "";

// 10번 반복
for(let i=1; i<11; i++) {
    // 1) i=1 -> 1<11(참) -> "*" = "" + "*" -> char="*", i=2(1증가)
    // 2) i=2 -> 2<11(참) -> "**" = "*" + "*" -> char="**", i=3(1증가)
    // ...
    // 10) i=10 -> char="**********"
    char = char + "*"; // 문자열 반복되면서 계속 붙음
}
alert(char); // **********